s60sc/ESP32-CAM_MJPEG2SD/src/utils.cpp
bool checkAlarm() {
  // call from appPing() to check if daily alarm time at given hour has occurred
  static time_t rolloverEpoch = 0;
  if (timeSynchronized && getEpoch() >= rolloverEpoch) {
    // alarm time reached, unless first call
    bool notInit = (rolloverEpoch == 0) ? false : true;
    rolloverEpoch = setAlarm(alarmHour); // set next alarm time
    return notInit;
  }
  return false;
}

/****************** weekly scheduled restart ******************/
// restart c. 02:00 every Tuesday (local time per 'timezone' setting), to clear any
// long term memory fragmentation. If NTP time is never obtained, falls back to a
// restart 7 days after boot, based on millis() uptime.

#define RESTART_WDAY 2 // struct tm tm_wday: 0=Sun, 1=Mon, 2=Tue, ...
#define RESTART_HOUR 2 // 02:00
#define MIN_RESTART_GAP_SECS (24UL * 60 * 60) // ignore a scheduled restart if the last one was more recent than this
#define FALLBACK_UPTIME_MS (7UL * 24 * 60 * 60 * 1000UL) // 7 days, compared against millis() (wraps safely after c. 49.7 days)

// last scheduled restart time (epoch secs), guarding against a runaway restart loop caused
// eg by a miscalculated next-restart time. RTC_DATA_ATTR is reinitialised on ESP.restart()
// (it only survives deep sleep wake), so RTC_NOINIT_ATTR + a magic number validity flag is
// used instead, matching the messageLog/crashLoop pattern in utilsLog.cpp - this does mean it
// contains random data on a genuine power up, which lastScheduledRestartValid guards against
RTC_NOINIT_ATTR time_t lastScheduledRestartEpoch;
RTC_NOINIT_ATTR uint32_t lastScheduledRestartValid;

static time_t nextWeeklyRestartEpoch(time_t fromEpoch) {
  // next occurrence of RESTART_WDAY at RESTART_HOUR:00:00, strictly after fromEpoch
  struct tm timeinfo = *localtime(&fromEpoch);
  int daysAhead = (RESTART_WDAY - timeinfo.tm_wday + 7) % 7;
  timeinfo.tm_mday += daysAhead;
  timeinfo.tm_hour = RESTART_HOUR;
  timeinfo.tm_min = 0;
  timeinfo.tm_sec = 0;
  timeinfo.tm_isdst = -1;
  time_t nextEpoch = mktime(&timeinfo);
  if (nextEpoch <= fromEpoch) nextEpoch += 7UL * 24 * 60 * 60; // today is restart day but time already passed
  return nextEpoch;
}

static void checkScheduledRestart() {
  // call regularly (from statusCheckTask()) to trigger the weekly restart, or the NTP-unavailable fallback
  static time_t nextRestartEpoch = 0;
  static bool fallbackArmed = true;

  if (timeSynchronized) {
    time_t nowEpoch = getEpoch();
    if (!nextRestartEpoch) {
      nextRestartEpoch = nextWeeklyRestartEpoch(nowEpoch);
      char inBuff[30];
      strftime(inBuff, sizeof(inBuff), "%d/%m/%Y %H:%M:%S", localtime(&nextRestartEpoch));
      LOG_INF("Next scheduled weekly restart due: %s", inBuff);
    }
    if (nowEpoch >= nextRestartEpoch) {
      bool noPriorRestart = (lastScheduledRestartValid != MAGIC_NUM);
      if (noPriorRestart || (nowEpoch - lastScheduledRestartEpoch) >= (time_t)MIN_RESTART_GAP_SECS) {
        lastScheduledRestartEpoch = nowEpoch;
        lastScheduledRestartValid = MAGIC_NUM;
        LOG_ALT("Weekly scheduled restart due (Tuesday %02u:00 %s)", RESTART_HOUR, timezone);
        doRestart("weekly scheduled restart");
      } else {
        LOG_WRN("Weekly scheduled restart due, but skipped as last restart was under 24 hrs ago");
        nextRestartEpoch = nextWeeklyRestartEpoch(nowEpoch); // reschedule so this isn't retried every cycle
      }
    }
  } else if (fallbackArmed && millis() >= FALLBACK_UPTIME_MS) {
    // NTP time never obtained - fallback to uptime based restart
    fallbackArmed = false; // guard re-entry until actual reboot occurs
    LOG_ALT("Weekly scheduled restart fallback: 7 days uptime reached without NTP sync");
    doRestart("uptime fallback restart (no NTP sync)");
  }
}

static void statusCheckTask(void* parameter) {
  while (true) {
    // regular status checks
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    if (!dataFilesChecked) checkDataFiles();
    if (!timeSynchronized) waitForNTPsync();
    if (appSetupDone) doAppPing(timeSynchronized);
    checkScheduledRestart();
#if INCLUDE_MQTT
    if (mqtt_active) startMqttClient();
#endif
  }
}

static inline void runStatusCheck() {
  if (statusCheckHandle) xTaskNotifyGive(statusCheckHandle);
}

/********************** misc functions ************************/

bool changeExtension(char* fileName, const char* newExt) {
  // replace original file extension with supplied extension (buffer must be large enough)
  size_t inNamePtr = strlen(fileName);
  // find '.' before extension text
  while (inNamePtr > 0 && fileName[inNamePtr] != '.') inNamePtr--;
  inNamePtr++;
  size_t extLen = strlen(newExt);
  memcpy(fileName + inNamePtr, newExt, extLen);
  fileName[inNamePtr + extLen] = 0;
  return (inNamePtr > 1) ? true : false;
}

void showProgress(const char* marker) {
  // show progess as dots or supplied marker
  static uint8_t dotCnt = 0;
  LOG_SEND("%s", marker); // progress marker
  if (++dotCnt >= DOT_MAX) {
    dotCnt = 0;
    LOG_SEND("\n");
  }
}

bool calcProgress(int progressVal, int totalVal, int percentReport, uint8_t &pcProgress) {
  // calculate percentage progress, only report back on percentReport boundary
  uint8_t percentage = (progressVal * 100) / totalVal;
  if (percentage >= pcProgress + percentReport) {
    pcProgress = percentage;
    return true;
  } else return false;
}

bool urlEncode(const char* inVal, char* encoded, size_t maxSize) {
  int encodedLen = 0;
  char hexTable[] = "0123456789ABCDEF";
  while (*inVal) {
    if (isalnum(*inVal) || strchr("$-_.+!*'(),:@~#", *inVal)) {
      *encoded++ = *inVal;
      encodedLen++;
    } else {
      encodedLen += 3; 
      *encoded++ = '%';
      *encoded++ = hexTable[(*inVal) >> 4];
      *encoded++ = hexTable[*inVal & 0xf];
    }
    if (encodedLen >= maxSize) return false;  // Buffer overflow
    inVal++;
  }
  *encoded = 0;
  return true;
}

void urlDecode(char* inVal) {
  // replace url encoded characters in-place
  // decoded output is always equal or shorter than input
  char* src = inVal;
  char* dst = inVal;
  while (*src) {
    if (*src == '%' && isxdigit((unsigned char)*(src+1)) && isxdigit((unsigned char)*(src+2))) {
      // decode %XX hex sequence
      char hex[3] = {*(src+1), *(src+2), 0};
      *dst++ = (char)strtoul(hex, nullptr, 16);
      src += 3;
    } else if (*src == '+') {
      // + is encoded space in form data
      *dst++ = ' ';
      src++;
    } else {
      *dst++ = *src++;
    }
  }
  *dst = 0; // NUL terminate
}

void listBuff (const uint8_t* b, size_t len) {
  // output buffer content as hex, 16 bytes per line
  if (!len || !b) LOG_WRN("Nothing to print");
  else {
    for (size_t i = 0; i < len; i += 16) {
      int linelen = (len - i) < 16 ? (len - i) : 16;
      for (size_t k = 0; k < linelen; k++) LOG_SEND(" %02x", b[i+k]);
      puts(" ");
    }
  }
}

